M-grat/STM32F4XX/006_DAC_STD_/src/main.c
#include "stm32f4xx.h"
#include "stm32f4_discovery.h"

int i=0;
void delay(uint32_t time)
{
	while(time--);
}
GPIO_InitTypeDef GPIO_InitStruct;
DAC_InitTypeDef DAG_InitStruct;

void GPIO_Config()
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA,ENABLE);
	GPIO_InitStruct.GPIO_Mode=GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_Pin=GPIO_Pin_5;
	GPIO_InitStruct.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd=GPIO_PuPd_NOPULL;
	GPIO_InitStruct.GPIO_Speed=GPIO_Speed_100MHz;

	GPIO_Init(GPIOA,&GPIO_InitStruct);

}
void ADC1_Config()
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC,ENABLE);
	DAG_InitStruct.DAC_WaveGeneration=DAC_WaveGeneration_None;
	DAG_InitStruct.DAC_Trigger=DAC_Trigger_None;
	DAG_InitStruct.DAC_OutputBuffer=DAC_OutputBuffer_Enable;
	DAC_Init(DAC_Channel_2,&DAG_InitStruct);

	DAC_Cmd(DAC_Channel_2,ENABLE);
}

int main(void)
{
	GPIO_Config();
	ADC1_Config();

  while (1)
  {
	  for(;i<255;i++)
	  {
		  DAC_SetChannel2Data(DAC_Align_8b_R,i);
		  delay(100000);
	  }
	  i=0;
  }
}


/*
 * Callback used by stm32f4_discovery_audio_codec.c.
 * Refer to stm32f4_discovery_audio_codec.h for more info.
 */
void EVAL_AUDIO_TransferComplete_CallBack(uint32_t pBuffer, uint32_t Size){
  /* TODO, implement your code here */
  return;
}

/*
 * Callback used by stm324xg_eval_audio_codec.c.
 * Refer to stm324xg_eval_audio_codec.h for more info.
 */
uint16_t EVAL_AUDIO_GetSampleCallBack(void){
  /* TODO, implement your code here */
  return -1;
}
